package Enum;

public enum TypeEnum {
	ZHIXUAN("直选", 1),
	ZUXUAN("组选", 2),
	SF("双飞",3),
	ZL("组六", 4),
	ZS("组三", 5),
	DD("独胆", 6),
	SFZL("双飞组六", 7),
	SFZS("双飞组三", 8),
	YMDW("一码定位", 9),
	EMDW("二码定位", 10),
	BZQB("豹子全包", 11),
	ZLSM("组六四码", 12),
	ZLWM("组六五码", 13),
	ZLLM("组六六码", 14),
	ZLQIM("组六七码", 15),
	ZLBM("组六八码", 16),
	ZLJM("组六九码", 17),
	ZLQB("组六全包", 18),
	ZSEM("组三二码", 19),
	ZSSANM("组三三码", 20),
	ZSSIM("组三四码", 21),
	ZSWM("组三五码", 22),
	ZSLM("组三六码", 23),
	ZSQIM("组三七码", 24),
	ZSBM("组三八码", 25),
	ZSJM("组三九码", 26),
	ZSQB("组三全包", 27),
	KD("跨度", 28),
	KD0("跨度0", 29),
	KD1("跨度1",30),
	KD2("跨度2", 31),
	KD3("跨度3",32),
	KD4("跨度4",33),
	KD5("跨度5",34),
	KD6("跨度6",35),
	KD7("跨度7",36),
	KD8("跨度8",37),
	KD9("跨度9",38),
	HZ("和值",38),
	HZ0("和值0",39),
	HZ1("和值1",40),
	HZ2("和值2",41),
	HZ3("和值3",42),
	HZ4("和值4",43),
	HZ5("和值5",44),
	HZ6("和值6",45),
	HZ7("和值7",46),
	HZ8("和值8",47),
	HZ9("和值9",48),
	HZ10("和值10",49),
	HZ11("和值11",50),
	HZ12("和值12",51),
	HZ13("和值13",52),
	HZ14("和值14",53),
	HZ15("和值15",54),
	HZ16("和值16",55),
	HZ17("和值17",56),
	HZ18("和值18",57),
	HZ19("和值19",58),
	HZ20("和值20",59),
	HZ21("和值21",60),
	HZ22("和值22",61),
	HZ23("和值23",62),
	HZ24("和值24",63),
	HZ25("和值25",64),
	HZ26("和值26",65),
	HZ27("和值27",66),
	FS("复式",67),
	FSSANM("复式三码", 68),
	FSSIM("复式四码", 69),
	FSWM("复式五码", 70),
	FSLM("复式六码", 71),
	FSQIM("复式七码", 72),
	FSBM("复式八码", 73),
	FSJM("复式九码", 74);

	private String label;
	private final int val;

	TypeEnum(String label,int val) {
		this.val = val;
		this.label = label;
	}

	public int getVal() {
		return val;
	}

	public String getLabel() {
		return label;
	}
}
